app/controllers/favorites_controller.rb

INSERT INTO "favorites" ("movie_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["movie_id", 1], ["user_id", 1], ["created_at", "2020-08-26 21:03:49.341368"], ["updated_at", "2020-08-26 21:03:49.341368"]]
---
	def create
		@movie.favorites.create!(user: current_user)