app/controllers/favorites_controller.rb

SELECT  "movies".* FROM "movies"  WHERE "movies"."slug" = 'iron-man' LIMIT 1
---
	def set_movie
		@movie = Movie.find_by!(slug: params[:movie_id])