app/controllers/reviews_controller.rb

  def create
    @review = @movie.reviews.new(review_params)
    @review.user = current_user
    if @review.save
---
INSERT INTO "reviews" ("comment", "created_at", "movie_id", "stars", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["comment", "Loved"], ["created_at", "2015-10-09 13:45:07.531803"], ["movie_id", 1], ["stars", 4], ["updated_at", "2015-10-09 13:45:07.531803"], ["user_id", 5]]

  def set_movie
    @movie = Movie.find_by!(slug: params[:movie_id])
---
SELECT  "movies".* FROM "movies"  WHERE "movies"."slug" = 'batman-vs-godzilla' LIMIT 1